Revit 2024 API
BendingDetailSegmentsRepresentation Enumeration
 Describes how the Bending Detail will represent the bar segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailSegmentsRepresentation
Visual Basic
Public Enumeration BendingDetailSegmentsRepresentation
Visual C++
public enum class BendingDetailSegmentsRepresentation
Members
Member name | Description
Standard |  The Bending Detail will represent the bar segments as they are.
Unfold |  Some of the bar segments will be unfolded so there is no intersection between them.
Offset |  Some of the bar segments will be lengthened so there is no intersection between them.
See Also
Autodesk.Revit.DB.Structure Namespace